[
    {
        "date": "02/27/26 @388",
        "title": "THE BLOG HAS OFICIALLY BEEN ADDED!!",
        "description": "WE DID IT WOOO, I'll be posting there more frequently than here. This place will now specically be for updates."
    },
    {
        "date": "02/26/26 @489",
        "title": "ok... boxes are back...",
        "description": "Got a little bit angry there but decided to bring some of them back with some new css. It's still def a work in progress."
    },
    {
        "date": "02/24/26 @432",
        "title": "SCREW THE .BOX'S",
        "description": "THATS IT, NO MORE .BOXES. ૮( ｡ •̀ ᴖ •́ ｡)ა I HATE THEM. THEY ARE THE WORST THING EVER. I DONT KNOW WHY I THOUGHT THEY WERE A GOOD IDEA. THEY ARE NOT A GOOD IDEA. THEY ARE GONE. WE ARE USING A CUSTOM MADE DEVIDER NOW. OH YEAH, THAT TICKER? GONE. SHOT HIM OUT BACK. REPLACED WITH A MARQUEE. THE TICKER JS WAS SO LAGGY."
    },
    {
        "date": "02/22/26 @422",
        "title": "Designed a button! ( ˶ˆ ヮ ˆ˵ )",
        "description": "Got Asprite and desiged my own button and one for my fiance(see the Kitsune in Neighbors)! You can also now put my button on YOUR website!( ദ്ദി ˙ᗜ˙ ) I uh... still haven't done anything with the blog... still trying to figure out a way to do that...╮(￣▽￣'')╭ "
    },
    {
        "date": "02/22/26 @266",
        "title": "Navbar FINALLY DONE",
        "description": "Finished the navbar! Took longer that I expected (coding error in the CSS, display: inline-block; was written as display: block; and THAT DOESNT WORK FOR WHAT I WANTED. Twas an easy goof up tho. Was WAY to uncafinated last night to catch it. :P)"
    },
    {
        "date": "02/21/26 @349",
        "title": "Added Ticker!",
        "description": "Added a ticker to the site! You can see it at the top of the page. Split up the stickers and the stamps into two different sections. They are now on opposite sides of the page."
    },
    {
        "date": "02/21/26 @411",
        "title": "Tweaked gifs on the site",
        "description": "Tweaked the gifs on the site to be more optimized and less laggy. I also added a new one of Miku throwing a tantrum."
    },
    {
        "date": "02/21/26 @349",
        "title": "Added a guestbook!",
        "description": "Added a guestbook to the site! You can find it on the right sidebar. Feel free to leave a message!"
    }
]